- Frist you show install

<code>pip install ipython-sql</code>

<code>pip install psycopg2</code>

<code>conda install -y -c conda-forge ipython-sql</code>

<code>conda install -y -c conda-forge postgresql</code>

- then reload jupyter 


- <code>%load_ext sql</code>
- this command is used for load sql model

- Next we should connect to postgresql 
- <code>%sql postgresql://postgres:00wasabi00@127.0.0.1/banking_tables</code>
- '%sql' means following all for sql
- 'postgresql' is the datatype you connect
- 'postgres' is username of your database
- '00wasabi00' is password for your database
- '127.0.0.1' is the localhost ip address 
- 'banking_tables' is the tables you want to access

In [1]:
%reload_ext sql
%sql postgresql://postgres:00wasabi00@127.0.0.1/bank_tables_1
#%sql postgresql://postgres:00wasabi00@127.0.0.1/banking_tables
#%sql postgresql://postgres:00wasabi00@127.0.0.1/salesdb
#        postgresql://will:longliveliz@localhost/shakes
#%sql postgresql://postgres:00wasabi00@127.0.0.1/insurance

'Connected: postgres@bank_tables_1'

In [17]:
%%sql
create table dual_account
(account_number   char(10),
 branch_name      varchar(20),
 balance          numeric(12,2),
 primary key(account_number),
 check(balance>=0)
)

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
Done.

[]

In [2]:
%%sql
create domain city_names varchar(30)

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
Done.

[]

In [5]:
%%sql
insert table test_1
(
    city    city_names,
    primary key (city)
)

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
(psycopg2.errors.SyntaxError) syntax error at or near "table"
LINE 1: insert table test_1
               ^

[SQL: insert table test_1
(
    city    city_names,
    primary key (city)
)]
(Background on this error at: http://sqlalche.me/e/f405)

In [8]:
%%sql
select *
from dual_account

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
(psycopg2.errors.UndefinedTable) relation "dual_account" does not exist
LINE 2: from dual_account
             ^

[SQL: select *
from dual_account]
(Background on this error at: http://sqlalche.me/e/f405)

In [7]:
%%sql
drop table dual_account

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
Done.

[]

In [15]:
%%sql
create table test_1
(
    city     char(20),
    street   city_names,
    primary key(city)

)

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
Done.

[]

In [14]:
%%sql
select *
from test_1

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
(psycopg2.errors.UndefinedTable) relation "test_1" does not exist
LINE 2: from test_1
             ^

[SQL: select *
from test_1]
(Background on this error at: http://sqlalche.me/e/f405)

In [13]:
%%sql
drop view test_1

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
Done.

[]

In [23]:
%%sql
select *
from branch

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
8 rows affected.

[('Brighton  ', 'Brooklyn  ', 7100000),
 ('Downtown  ', 'Brooklyn  ', 9000000),
 ('Mianus    ', 'Horseneck ', 400000),
 ('North Town', 'Rye       ', 3700000),
 ('Perryridge', 'Horseneck ', 1700000),
 ('Pownal    ', 'Bennington', 300000),
 ('Redwood   ', 'Palo Alto ', 2100000),
 ('Round Hill', 'Horseneck ', 8000000)]

In [22]:
%%sql
(select *
from branch
)
intersect
(
select *
    from branch
)

 * postgresql://postgres:***@127.0.0.1/bank_tables_1
8 rows affected.

[('Pownal    ', 'Bennington', 300000),
 ('Redwood   ', 'Palo Alto ', 2100000),
 ('Brighton  ', 'Brooklyn  ', 7100000),
 ('Downtown  ', 'Brooklyn  ', 9000000),
 ('North Town', 'Rye       ', 3700000),
 ('Mianus    ', 'Horseneck ', 400000),
 ('Round Hill', 'Horseneck ', 8000000),
 ('Perryridge', 'Horseneck ', 1700000)]